Конфигурация/Documents/РаспределениеАктивовЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РаспределениеАктивовЕПС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РаспределенияАктивовЕПС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСделке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
								<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/РаспределенияАктивовЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РаспределенияАктивовЕПС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сделки</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/РаспределениеАктивовЕПС/Ext/ObjectModule.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	ЭтотОбъект.ПоСделке = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоПроведениеИзСделки") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЦенныеБумаги.Сделка КАК Сделка,
			|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ЦенныеБумаги.Количество КАК Количество
			|ПОМЕСТИТЬ _ЦенныеБумаги
			|ИЗ
			|	&ЦенныеБумаги КАК ЦенныеБумаги
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦенныеБумаги.Сделка КАК Сделка,
			|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СУММА(_ЦенныеБумаги.Количество) КАК Количество
			|ПОМЕСТИТЬ _КлассификацияЦБ
			|ИЗ
			|	_ЦенныеБумаги КАК _ЦенныеБумаги
			|ГДЕ
			|	НЕ ВЫРАЗИТЬ(_ЦенныеБумаги.Сделка КАК Документ.Сделка).ПриобретениеПаев
			|
			|СГРУППИРОВАТЬ ПО
			|	_ЦенныеБумаги.Сделка,
			|	_ЦенныеБумаги.ЦеннаяБумага
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаЦенныеБумаги.Ссылка КАК Ссылка,
			|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СУММА(СделкаЦенныеБумаги.Количество) КАК Количество
			|ПОМЕСТИТЬ _СделкиЦБ
			|ИЗ
			|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|ГДЕ
			|	СделкаЦенныеБумаги.Ссылка В
			|			(ВЫБРАТЬ
			|				_КлассификацияЦБ.Сделка
			|			ИЗ
			|				_КлассификацияЦБ КАК _КлассификацияЦБ)
			|
			|СГРУППИРОВАТЬ ПО
			|	СделкаЦенныеБумаги.Ссылка,
			|	СделкаЦенныеБумаги.ЦеннаяБумага
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КлассификацияЦБ.Сделка КАК Сделка,
			|	_КлассификацияЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_КлассификацияЦБ.Количество КАК КоличествоКлассификации,
			|	ЕСТЬNULL(_СделкиЦБ.Количество, 0) КАК КоличествоСделки
			|ИЗ
			|	_КлассификацияЦБ КАК _КлассификацияЦБ
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиЦБ КАК _СделкиЦБ
			|		ПО _КлассификацияЦБ.Сделка = _СделкиЦБ.Ссылка
			|			И _КлассификацияЦБ.ЦеннаяБумага = _СделкиЦБ.ЦеннаяБумага
			|ГДЕ
			|	_КлассификацияЦБ.Количество > ЕСТЬNULL(_СделкиЦБ.Количество, 0)";
		
		Запрос.УстановитьПараметр("ЦенныеБумаги", ЭтотОбъект.ЦенныеБумаги.Выгрузить());
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ПоСделке) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "_КлассификацияЦБ.Количество > ЕСТЬNULL(_СделкиЦБ.Количество, 0)", "_КлассификацияЦБ.Количество <> ЕСТЬNULL(_СделкиЦБ.Количество, 0)");	
		КонецЕсли;	
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru=""По сделке " + ВыборкаДетальныеЗаписи.Сделка
			+ ?(ЗначениеЗаполнено(ЭтотОбъект.ПоСделке), " распределено иное количество актива ", " распределено большее количество актива ") + ВыборкаДетальныеЗаписи.ЦеннаяБумага 
			+ ", чем указано в сделке: " + ВыборкаДетальныеЗаписи.КоличествоКлассификации + " из " + ВыборкаДетальныеЗаписи.КоличествоСделки+""""),,,, Отказ);
		КонецЦикла;
		
		Для Каждого СтрокаЦБ Из ЭтотОбъект.ЦенныеБумаги Цикл
			Если СтрокаЦБ.Сделка.СчетДоверительногоУправления <> ЭтотОбъект.СчетДоверительногоУправления Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru=""В строке " + СтрокаЦБ.НомерСтроки
				+ " выбрана сделка другого счета ДУ """),ЭтотОбъект ,"ЦенныеБумаги[" + (СтрокаЦБ.НомерСтроки-1)+"].Сделка",, Отказ);
			КонецЕсли;	
			Если НачалоДня(СтрокаЦБ.Сделка.Дата) <> НачалоДня(ЭтотОбъект.Дата) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru=""В строке " + СтрокаЦБ.НомерСтроки + " выбрана сделка за другую дату"""),ЭтотОбъект ,"ЦенныеБумаги[" + (СтрокаЦБ.НомерСтроки-1) + "].Сделка",, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.РаспределенияАктивовЕПС.Очистить();
	
	Движения.РаспределенияАктивовЕПС.Записывать = Истина;
	Для Каждого ТекСтрокаЦенныеБумаги Из ЦенныеБумаги Цикл
		Движение = Движения.РаспределенияАктивовЕПС.Добавить();
		Движение.Организация = Организация;
		Движение.Сделка = ТекСтрокаЦенныеБумаги.Сделка;
		Движение.Рынок = ТекСтрокаЦенныеБумаги.Рынок;
		Движение.ЦеннаяБумага = ТекСтрокаЦенныеБумаги.ЦеннаяБумага;
		Движение.УчетныйАктивЕПС = ТекСтрокаЦенныеБумаги.УчетныйАктивЕПС;
		Движение.Количество = ТекСтрокаЦенныеБумаги.Количество;
	КонецЦикла;

	Движения.РаспределенияАктивовЕПС.Записать();
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоПроведениеИзСделки") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РаспределениеАктивовЕПСЦенныеБумаги.НомерСтроки КАК НомерСтроки,
			|	РаспределениеАктивовЕПСЦенныеБумаги.Сделка КАК Сделка,
			|	РаспределенияАктивовЕПС.Регистратор КАК Регистратор,
			|	РаспределениеАктивовЕПСЦенныеБумаги.Количество КАК КоличествоРаспределение,
			|	СделкаЦенныеБумаги.Количество КАК КоличествоСделка,
			|	СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправленияСделка,
			|	РаспределениеАктивовЕПСЦенныеБумаги.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НАЧАЛОПЕРИОДА(СделкаЦенныеБумаги.Ссылка.Дата, ДЕНЬ) КАК ДатаСделка,
			|	НАЧАЛОПЕРИОДА(РаспределениеАктивовЕПСЦенныеБумаги.Ссылка.Дата, ДЕНЬ) КАК Дата
			|ИЗ
			|	Документ.РаспределениеАктивовЕПС.ЦенныеБумаги КАК РаспределениеАктивовЕПСЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
			|		ПО РаспределениеАктивовЕПСЦенныеБумаги.Сделка = РаспределенияАктивовЕПС.Сделка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|		ПО РаспределениеАктивовЕПСЦенныеБумаги.Сделка = СделкаЦенныеБумаги.Ссылка
			|ГДЕ
			|	РаспределениеАктивовЕПСЦенныеБумаги.Ссылка = &Ссылка
			|	И (РаспределенияАктивовЕПС.Регистратор <> &Ссылка
			|			ИЛИ РаспределениеАктивовЕПСЦенныеБумаги.Количество <> СделкаЦенныеБумаги.Количество
			|			ИЛИ НАЧАЛОПЕРИОДА(РаспределениеАктивовЕПСЦенныеБумаги.Ссылка.Дата, ДЕНЬ) <> НАЧАЛОПЕРИОДА(СделкаЦенныеБумаги.Ссылка.Дата, ДЕНЬ)
			|			ИЛИ СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления <> РаспределениеАктивовЕПСЦенныеБумаги.Ссылка.СчетДоверительногоУправления)";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Регистратор <> Ссылка Тогда
			
				ТекстСообщения = СтрШаблон("В строке %1 выбрана сделка %2, по которой активы уже распределены документом %3", ВыборкаДетальныеЗаписи.НомерСтроки, ВыборкаДетальныеЗаписи.Сделка, ВыборкаДетальныеЗаписи.Регистратор);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект , "ЦенныеБумаги["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].Сделка",, Отказ);
			
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.КоличествоРаспределение <> ВыборкаДетальныеЗаписи.КоличествоСделка Тогда
			
				ТекстСообщения = СтрШаблон("В настоящее время не поддерживается частичное распределение активов: строка %1, сделка %2", ВыборкаДетальныеЗаписи.НомерСтроки, ВыборкаДетальныеЗаписи.Сделка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект , "ЦенныеБумаги["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].Сделка",, Отказ);
			
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.СчетДоверительногоУправленияСделка <> ВыборкаДетальныеЗаписи.СчетДоверительногоУправления Тогда
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru=""В строке " + ВыборкаДетальныеЗаписи.НомерСтроки
				+ " выбрана сделка другого счета ДУ """), ЭтотОбъект ,"ЦенныеБумаги["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].Сделка",, Отказ);
			
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.ДатаСделка <> ВыборкаДетальныеЗаписи.Дата Тогда
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru=""В строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " выбрана сделка за другую дату"""), ЭтотОбъект ,"ЦенныеБумаги["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].Сделка",, Отказ);
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
